app/views/photos/_form.html.erb

    <%= hidden_field_tag "photo[tag_ids][]", nil %>
    <% Tag.all.each do |tag| %>
      <%=check_box_tag "photo[tag_ids][]", tag.id, @photo.tag_ids.include?(tag.id) %>
---
SELECT "tags".* FROM "tags"
SELECT "tags".id FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."photo_id" IS NULL