app/views/photos/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."photo_id" = 1
---
  <ul>
  <% @photo.tags.each do |tag| %>