app/controllers/photo_galleries_controller.rb

  def index
    @photo_galleries = PhotoGallery.all
---
SELECT "photo_galleries".* FROM "photo_galleries"

  def show
    @photo_gallery = PhotoGallery.find(params[:id])

    @photos = Array.new
    @photos_json = Array.new

    @photo_gallery.tags.each do |tag|
      tag.photos.each do |photo|
---
SELECT "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tags".* FROM "tags" INNER JOIN "photo_gallery_taggings" ON "tags"."id" = "photo_gallery_taggings"."tag_id" WHERE "photo_gallery_taggings"."photo_gallery_id" = 1
SELECT "photos".* FROM "photos" INNER JOIN "taggings" ON "photos"."id" = "taggings"."photo_id" WHERE "taggings"."tag_id" = 1

  def edit
    @photo_gallery = PhotoGallery.find(params[:id])
---
SELECT "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @photo_gallery = PhotoGallery.new(params[:photo_gallery])

    respond_to do |format|
      if @photo_gallery.save
---
INSERT INTO "photo_galleries" ("created_at", "name", "public", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 12 Mar 2013 16:15:40 UTC +00:00], ["name", "Gallery 1"], ["public", nil], ["updated_at", Tue, 12 Mar 2013 16:15:40 UTC +00:00]]

  def update
    @photo_gallery = PhotoGallery.find(params[:id])
---
SELECT "photo_galleries".* FROM "photo_galleries" WHERE "photo_galleries"."id" = $1 LIMIT 1  [["id", "1"]]