app/views/photo_galleries/_form.html.erb

SELECT "tags".* FROM "tags"
SELECT "tags".id FROM "tags" INNER JOIN "photo_gallery_taggings" ON "tags"."id" = "photo_gallery_taggings"."tag_id" WHERE "photo_gallery_taggings"."photo_gallery_id" IS NULL
---
    <%= hidden_field_tag "photo_gallery[tag_ids][]", nil %>
    <% Tag.all.each do |tag| %>
      <%=check_box_tag "photo_gallery[tag_ids][]", tag.id, @photo_gallery.tag_ids.include?(tag.id) %>